<template>
  <div class="agreement">
    <h1>《学而思VIPX平台用户服务协议》</h1>
    <p>
      欢迎使用“学而思VIPX”！好未来拥有“学而思VIPX”网站、手机应用软件所有权，并负责平台的运营。我们致力于利用移动互联技术搭建学习服务平台，让家长找老师不再难。<br>家长您在访问和使用“学而思VIPX”提供的服务前请仔细阅读本协议，当您确认阅读完本协议并对本协议无异议,点击“学而思VIPX我已阅读并同意《学而思VIPX用户服务协议》”按钮完成注册，这表示您与“学而思VIPX”已达成本协议并接受所有的服务条款。
    </p>
    <h2>一、特别提示</h2>
    <p>
      在使用本平台服务之前，您确认，在您开始注册程序使用“学而思VIPX”服务前，您应当具备中华人民共和国法律规定的与您行为相适应的民事行为能力。若您不具备前述与您行为相适应的民事行为能力，则您及您的监护人应依照法律规定承担因此而导致的一切后果。同时您应了解并知悉，“学而思VIPX”作为提供专业一对一外教服务的平台，通过先进的互联网技术进行直播互动教学，不可避免的网络因素的影响，对此“学而思VIPX”不承担相关责任，“学而思VIPX“将会根据相应的学员规则进行处理，对此您表示理解。<br/>
      “学而思VIPX”根据以下服务条款为您提供服务。这些条款可由“学而思VIPX”随时更新，且毋须另行通知。“学而思VIPX”使用条款（以下简称“使用条款”）一旦发生变动，“学而思VIPX”将在网页上公布修改内容。修改后的使用条款一旦在网页上公布即有效代替原来的使用条款。此外，当您使用“学而思VIPX”服务时，您应遵守“学而思VIPX”随时公布的与该服务相关的指引和规则。前述所有的指引和规则，均构成本使用条款的一部分。您一旦使用“学而思VIPX”服务，即视为您已了解并完全同意本使用条款各项内容，包括“学而思VIPX”对使用条款随时所做的任何修改，并成为“学而思VIPX”用户。
    </p>
    <h2>二、注册与账户</h2>
    <h3>1.注册</h3>
    <p>
      为了能使用本平台，您同意以下事项：依本平台注册提示填写正确的注册手机号码、密码和名号，并确保今后更新的登录手机号码、名号、头像等资料的有效性和合法性。<br/>
      如发生下列任何一种情形，“学而思VIPX”有权随时中断或终止提供本条款项下的网络服务而无需对您或任何第三方承担任何责任：<br/>
      (1) 您违反本条款中规定的使用规则；<br/>
      (2) 您通过本平台群发垃圾信息，接收、发送、存放或提供下载传播含有虚假、侮辱、诽谤、恐吓或骚扰、侵犯他人版权或人身权或其他合法权益等违法或有违社会公序良俗的，或侵犯其他任何第三方的专利权、著作权、商标权、名誉权或其他任何合法权益的信息，“学而思VIPX”有权在不通知您的情况下立即删除违规内容；<br/>
      (3) 您对其提供的内容监管不力，导致发布内容中出现涉及任何危害国家安全、淫秽色情、犯罪等违法内容的，“学而思VIPX”有权在不通知您的情况下立即删除违规内容，情节严重的，“学而思VIPX”有权立即删除；<br/>
      (4) 您冒充他人、利用他人的名义发布任何消息；<br/>
      (5) 您恶意使用注册账户导致其他人误认；<br/>
      (6) 其他令“学而思VIPX”有理由认为您的行为（包括但不限于您的任何言论和其它行为）违反或可能违反了国家法律和法规的任何规定。<br/>
      “学而思VIPX”无须对您的任何登记资料承担任何责任，包括但不限于鉴别、核实任何登记资料的真实性、正确性、完整性、适用性、是否为最新资料的责任。
    </p>
    <h3>2、账户、密码及安全</h3>
    <p>
      完成注册后，您应谨慎保管您的注册账号及密码。您应对所有使用您的密码及账号的活动负完全的责任。您同意：<br/>
      (1) 您的“学而思VIPX”账号遭到未获授权的使用，或者发生其它任何安全问题时，您将立即通知“学而思VIPX”；<br/>
      (2) 如果您未保管好自己的账号和密码，因此而产生的任何损失或损害，“学而思VIPX”无法也不承担任何责任；<br/>
      (3) 每个交易您都要对账号中的所有行为和事件负全责。如果您未保管好自己的账号和密码而对您、“学而思VIPX”或第三方造成的损害，您将负全部责任。
    </p>
    <h3>3、隐私声明</h3>
    <p>
      为履行本合同，“学而思VIPX”有权在平台的服务器上保存您的信息（包括但不限于您的注册信息、消费信息）。“学而思VIPX”承诺不公开您的信息，除非您授权“学而思VIPX”透露这些信息，或者相应的法律法规或司法、行政程序要求“学而思VIPX”提供您的信息（包括但不限于您的注册信息、消费信息、推广网站或网页）。<br/>
      “学而思VIPX”不向其他任何第三方保证和承诺您提交的网页和信息符合注册标准，您自行对其网站提供的信息内容等承担全部责任。“学而思VIPX”产生的所有内容的知识产权归“学而思VIPX”所有。未经“学而思VIPX”许可，任何人不得除自身学习使用外擅自（包括但不限于：以非法的方式复制、传播、展示、镜像、上载、下载）使用。
    </p>
    <h3>4、订单</h3>
    <p>
      本条款所述“订单”，是指您在“学而思VIPX”平台上根据自身需求自行匹配达成的老师与家长之间的服务条款。家长在平台上搜索到合适的老师后，订单在下述时刻同时满足时正式成立：<br/>
      (1) 家长通过“学而思VIPX”已支付课时费用；<br/>
      (2) 家长通过“学而思VIPX”联系到能够提供服务的老师并商定授课时间、方式等服务信息；有关课时订单的修改、取消、退费等事项，请参见“学而思VIPX”网站的具体规则介绍。
    </p>
    <h3>5、授课、确认、付款及点评</h3>
    <p>
      老师根据约定方式进行授课。授课完毕后，由家长在网站或客户端进行授课确认，老师履行完毕与学生/家长达成的服务合同后，家长可在网站或客户端上做出相应的评价，以便“学而思VIPX”进一步改进服务；
    </p>
    <h2>三、“学而思VIPX”的服务</h2>
    <p>
      1、本平台及本平台所使用之相关软件（以下简称“软件”）的知识产权及所有权均归属“学而思VIPX”或其软件供应商，并受到相关法律的保护；<br/>
      2、经由本平台或广告商向您呈现之赞助广告或信息所包含之内容，亦受到著作权、商标权、服务商标、专利权或其它专属权利之法律保护。未经“学而思VIPX”或广告商明示授权，您不得修改、出租、出售、散布本平台或软件之任何部份或全部，或据以制作衍生著作，或使用擅自修改后的软件，包括但不限于为了未经授权而使用本平台之目的；<br/>
      3、“学而思VIPX”仅授予您个人、不可移转及非专属之使用权，使您得于单机计算机使用其软件之目的码，但您不得（并不得允许任何第三人）复制、修改、创作衍生著作、进行还原工程、反向组译，或以其它方式发现原始码，或出售、转让、再授权或提供软件设定担保，或以其它方式移转软件之任何权利。您同意将通过由“学而思VIPX”所提供的界面而非任何其它途径使用本平台；<br/>
      4、您使用本服务之风险由您个人负担。本服务系依“现状”及“现有”基础提供。“学而思VIPX”对本服务不提供任何明示或默示的担保或保证，包含但不限于商业适售性、特定目的之适用性及未侵害他人权利等担保或保证；<br/>
      5、“学而思VIPX”不保证以下事项∶<br/>
      · 本服务将符合您的要求；<br/>
      · 本服务将不受干扰、及时提供、安全可靠或不会出错；<br/>
      · 使用本服务取得之结果正确可靠；<br/>
      · 您经由本服务购买或取得之任何产品、服务、资讯或其它信息将符合您的期望；<br/>
      6、 是否使用本服务下载或取得任何资料应由您自行考虑且自负风险，因任何资料之下载而导致的您电脑系统之任何损坏或数据流失等后果，由您自行承担；<br/>
      7、您自“学而思VIPX”或经由本平台服务取得的任何建议或信息，无论是书面或口头形式，除非本使用条款有明确规定，将不构成本使用条款以外之任何保证。<br/>
      8、 “学而思VIPX”需要定期或不定期的对提供网络服务的平台（如互联网网站、移动网络等）或相关的设备进行检修或维护，如因此可能造成服务在合理时间内中断，“学而思VIPX”应尽可能事先通知您，但无需为此承担任何责任。<br/>
      9、“学而思VIPX”可以根据中国法律法规的调整、行政执法机关的命令和社会伦理道德的变化相应调整“学而思VIPX”服务的标准。<br/>
      10、您所从事的经营等业务不得对“学而思VIPX”及“学而思VIPX”关联公司的利益构成任何现实或潜在的损害或冲突，否则“学而思VIPX”有权通知您立即终止平台服务，而无需承担其他法律责任和费用补偿。<br/>
      11、“学而思VIPX”如遭受不可抗力事件（包括政府管制、政策调整、恐怖主义、黑客攻击、自然灾害、劳动条件、停电、电信部门技术调整以及病毒入侵等），由此造成您暂时无法使用或终止使用“学而思VIPX”平台服务，不视为违约。<br/>
      12、 “学而思VIPX”为任何涉嫌侵权已设置便捷的投诉与举报渠道，并将会依法采取合理救济措施。
    </p>
    <h2>四、“学而思VIPX”平台服务使用规范</h2>
    <p>
      1、在“学而思VIPX”平台使用“学而思VIPX”服务过程中，您同意并承诺遵守中华人民共和国相关法律法规的所有规定，并对以任何方式使用您的密码和您的账号使用本平台的任何行为及其结果承担全部责任。如您的行为违反国家法律和法规的任何规定，有可能构成犯罪的，将被追究刑事责任，并由您承担全部法律责任。如果您不是具备完全民事权利能力和完全民事行为能力的自然人，请您征得其监护人许可或由其监护人直接使用“学而思VIPX”服务。<br/>
      您同意将不会利用本平台进行任何违法或不正当的活动，包括但不限于下列行为：<br/>
      (1) 将不会在本平台上发布或以其他方式传送含有下列内容之一的信息：<br/>
      · 反对宪法所确定的基本原则的；<br/>
      · 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；<br/>
      · 损害国家荣誉和利益的；<br/>
      · 煽动民族仇恨、民族歧视、破坏民族团结的；<br/>
      · 破坏国家宗教政策，宣扬邪教和封建迷信的；<br/>
      · 散布谣言，扰乱社会秩序，破坏社会稳定的；<br/>
      · 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；<br/>
      · 侮辱或者诽谤他人，侵害他人合法权利的；<br/>
      · 含有虚假、诈骗、有害、胁迫、侵害他人隐私、骚扰、侵害、中伤、粗俗、猥亵、或其它道德上令人反感的内容；<br/>
      · 含有中国法律、法规、规章、条例以及任何具有法律效力之规范所限制或禁止的其它内容的；<br/>
      · 含有“学而思VIPX”认为不适合在“学而思VIPX”展示的内容；<br/>
      (3) 侵犯本平台其他用户或他人权益的行为或内容<br/>
      · 恶意攻击、辱骂、诽谤、骚扰他人；<br/>
      · 威胁他人的人身安全、法律安全；<br/>
      · 恶意泄露他人个人隐私；<br/>
      · 冒充他人；<br/>
      · 其他侵犯第三方合法权益的行为。<br/>
      (4) 破坏本平台运营安全或服务质量的行为和内容：<br/>
      · 群发广告；<br/>
      · 使用程序操作；<br/>
      · 发布垃圾内容，包括：答案、评论、私信，以及问题、问题补充说明、话题名称、话题描述等可被公共编辑的内容；<br/>
      · 恶意修改可被公共编辑的内容；<br/>
      · 恶意发布重复内容；<br/>
      · 使用马甲等作弊手段操作内容和排序；<br/>
      · 违反“学而思VIPX”的用户名管理细则、用户头像管理细则；<br/>
      · 破坏“学而思VIPX”平台良好氛围，令其他您不悦或难堪的行为和内容；<br/>
      · 其他破坏“学而思VIPX”运营安全或服务质量的行为和内容。<br/>
      (5)未经合法授权而截获、篡改、收集、储存或删除他人个人信息、站内邮件或其他数据资料，或将获知的此类资料用于任何非法或不正当目的。 “学而思VIPX”有权对您使用“学而思VIPX”的情况进行审查和监督，如您在使用“学而思VIPX”时违反任何上述规定，“学而思VIPX”或其授权的人有权要求您改正或直接采取一切必要的措施（包括但不限于更改或删除您张贴的内容、暂停或终止您使用“学而思VIPX”的权利）以减轻您不当行为造成的影响。<br/>
      2、“学而思VIPX”尊重他人知识产权，呼吁您也要同样尊重知识产权。<br/>
      3、 “学而思VIPX”之服务与资料是基于“现状”提供，而且“学而思VIPX”明确地表示拒绝对于“服务”、“资料”或“产品”给予任何明示或暗示之保证，包括但不限于，得为商业使用或适合于特定目的之保证。“学而思VIPX”对于因“服务”、“资料”或“产品”所生之任何直接、间接、附带的或因此而导致之衍生性损失概不负责。<br/>
      4、 如果您对他人的知识产权造成了侵害，“学而思VIPX”将依国家法律法规的规定，或在适当的情形下，将依其服务条款或其相关规范性规定，删除特定内容或以至终止您对账户的使用。<br/>
      5、“学而思VIPX”尊重他人的任何权利（包括知识产权），同时也要求我们的使用者也尊重他人之权利。“学而思VIPX”在适当情况下，得自行决定终止侵害或违反他人权利之使用者的账号。<br/>
      6、 若您认为您的作品的著作权遭到侵害或您的知识产权被侵犯，根据《信息网络传播权保护条例》的规定，您需及时向“学而思VIPX”联系并提供详实的举证材料。或请到中华人民共和国国家版权局下载《要求删除或断开链接侵权网络内容的通知》（下称“删除通知”）的示范格式，如果您不明白“删除通知”的内容，请登录中华人民共和国国家版权局查看《要求删除或断开链接侵权网络内容的通知》填写说明。<br/>
      7、 您对在“学而思VIPX”的用户名和密码的安全性负全部责任，并对以您的用户名进行的所有活动和事件负全部责任，您若发现任何非法使用账号或存在安全漏洞的情况，应立即通知“学而思VIPX”。<br/>
      8、 如您违反本条款规定的任何条款，“学而思VIPX”有权拒绝向您提供平台服务，并有进一步追究您法律责任的权利。
    </p>
    <h2>五、未成年人的特别注意条款</h2>
    <p>
      如果您不是具备完全民事行为能力和完全民事行为能力的自然人，请您征得其监护人许可或其监护人直接使用本平台。后续线上线下上课、付款等事宜也需由监护人陪同或征得监护人许可完成。
    </p>
    <h2>六、法律</h2>
    <p>
      本网站服务条款与中华人民共和国的法律法规相一致，您和“学而思VIPX”一致同意服从由网站所有权人所在地的法院管辖。如发生“学而思VIPX”服务条款与中华人民共和国法律相抵触时，则这些条款将完全按照法律的规定重新解释，而其他条款则依旧保持对您产生法律效力和影响。
    </p>
    <h2>七、通知</h2>
    <p>
      “学而思VIPX”将通过在本网站上发布通知或其他方式与您进行联系。您同意用网站发布通知方式接收所有条款、通知、披露和其他信息。
    </p>
    <h2>八、条款生效</h2>
    <p>
      1、本条款自您注册“学而思VIPX”之日起生效。<br/>
      2、“学而思VIPX”在法律允许范围内对本条款拥有解释权。
    </p>
    <h2>九、其他</h2>
    <p>
      1、本使用条款之标题仅供方便而设，不具任何法律或契约效果。<br/>
      2、本平台未行使或执行本使用条款任何权利或规定，不构成对前述权利或权利之放弃。
    </p>
  </div>
</template>
<style lang="less" scoped>
@import '../../styles/basic.less';
.agreement{
  padding:0.4rem;
  color:@col-darkgray;
  h1{
    text-align:center;
    font-size: 0.32rem;
    margin:0.3rem 0;
  }
  h2{
    font-size: 0.28rem;
    font-weight: bold;
    padding:0.4rem 0 0.1rem 0;
  }
  p{
    line-height: 0.5rem;
    font-size: 0.26rem;
  }
}
</style>
