<template>
  <div class="agreement">
    <h1>用户信息保护及隐私政策</h1>
    <p>
      本《用户信息保护及隐私政策》适用于VIPX旗下所有的产品及服务（以下简称“VIPX”或“平台”），您通过我们的产品及服务而接入的其他第三方产品或服务除外。<b>请您务必在点击同意本政策之前，审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款、法律适用和争议解决条款。免除或者限制责任的条款将以粗体标识，您应重点阅读。</b>如您对政策有任何疑问，可按照本政策列明方式与VIPX取得联系。
    </p>
    <p>当您点击确认同意本政策，即表示您已充分阅读、理解且接受本政策的全部内容，并与VIPX达成一致，本政策对您及VIPX均具有法律约束力。</p>
    <p>VIPX有权在必要时修改本政策条款，并以平台内公示的方式通知到您。您可以随时在本平台查阅修改后的最新版本政策。如您不同意修改后的政策，您有权终止对平台的授权。本政策更新后，如果您继续使用相应平台功能，即视为您已接受修改后的政策。</p>
    <h2>一、定义</h2>
    <p>1.VIPX旗下产品及服务：指VIPX网络及技术服务提供者通过下述途径向您提供的产品及服务：包括但不限于VIPX网站、移动应用、客户端、相关微信开放平台帐号或小程序以及供第三方网站和应用程序使用的VIPX软件开发工具包（SDK）和应用程序编程接口（API）、未设独立隐私政策的VIPX关联公司提供的产品及服务等。</p>
    <p>2.其他第三方产品或服务：包括但不限于VIPX以外的其他交易相对方、第三方网站以及第三方服务提供者为您提供的产品或服务。</p>
    <p>3.关联公司：指好未来教育集团（TAL Education Group）最新上市公司年报披露的好未来教育集团的关联公司。</p>
    <p>4.合作伙伴：指VIPX服务提供过程中涉及的第三方信息系统、支付机构、微信/QQ/微博等用于第三方登录的社交平台，以及VIPX为实现部分功能、提供更好的客户服务和用户体验而进行合作的其他第三方主体或平台。</p>
    <h2>二、用户权利义务</h2>
    <p>1.您理解并同意，享受VIPX服务过程中，您需自行准备相关设备且承担如下费用：</p>
    <p>1.1上网设备：包括并不限于电脑或者其他上网终端、调制解调器及其他必备的上网装置；</p>
    <p>1.2上网开支：包括并不限于网络接入费、上网设备租用费、手机流量费等；</p>
    <p>1.3您理解并保证，您具有享受VIPX相关服务的民事行为及责任能力，在使用本服务过程中所提供的资料均具有真实性、准确性，信息完整有效。如信息有变动的，应及时进行更新。如因前述原因导致您本人或第三人人身或财产受到损害，VIPX不承担责任。</p>
    <p>2. 您理解并保证，您在享受VIPX相关服务过程中，不违背中华人民共和国大陆地区相关法律法规之规定，不利用VIPX服务从事非法行为。您将对您在VIPX内发布的所有信息及言论承担所有责任。</p>
    <p>3.VIPX非常重视保护用户个人信息。您在使用VIPX服务过程中，涉及用户真实姓名/名称、通信地址、联系电话、电子邮箱等隐私信息的，VIPX将予以严格保密，除本协议约定情形或法律另有规定外，VIPX不会向外界披露用户隐私信息。</p>
    <h2>三、VIPX责任</h2>
    <p>1.VIPX严格按照本政策及《网络安全法》、《个人信息安全规范》等相关法律法规的约定收集、使用、储存和分享您的个人信息，本政策对个人信息保护相关内容未作明确约定的，以《网络安全法》、《个人信息安全规范》等相关法律法规约定为准。除因VIPX存在过错外，您自行承担使用VIPX服务产生的风险。您如因本人过错或行为而遭受人身损害、财产损害，造成第三方人身损害、财产损害或由第三人造成您人身、财产损害的，应当依法向责任主体追究法律责任，VIPX不承担相关责任。</p>
    <p>2.VIPX将会尽其商业上的合理努力保障您在VIPX及服务中的数据存储安全，但是，VIPX并不能就此提供完全保证您的个人信息不会受到任何侵害。VIPX不对您在VIPX及服务中相关数据的删除或储存失败负责，您可根据自身需求自行备份VIPX及服务中的相关数据。</p>
    <p>3.如您违反本政策，VIPX保留暂停或终止为您提供VIPX各项服务的权利，同时有权拒绝提供服务、关闭个人帐号、清除或编辑内容、取消订单、删除各类不符合法律规定或不真实信息内容而无需通知用户。</p>
    <p>4.您理解并同意：在使用本服务的过程中，可能会遇到不可抗力、技术风险等因素，使本服务发生中断，对于下述原因导致的合同履行障碍、履行瑕疵、履行延后或履行内容变更、数据丢失等情形，VIPX在法律允许的最大范围内免责：</p>
    <p>4.1.因自然灾害、罢工、暴乱、战争、政府行为、司法行政命令等不可抗力因素。</p>
    <p>4.2您或VIPX的电脑软件、系统、硬件出现故障或其他原因导致您无法使用VIPX。</p>
    <p>4.3因电力供应故障、通讯网络故障（包括但不限于电子通讯传达失败或延时、用于电子通讯的计算机程序对电子通讯的拦截或操纵）等公共服务因素或您自身因素（包括但不限于您操作不当、通过非VIPX授权的方式使用本服务）或第三人因素（包括但不限于受到计算机病毒、木马或其他恶意程序、黑客攻击的破坏、顾客的错误下单等错误操作）。</p>
    <p>4.4在VIPX已尽善意管理的情况下，因常规或紧急的设备与系统维护、设备与系统故障、缺陷、网络信息与数据安全、技术风险等因素。</p>
    <p>4.5 您知悉并理解，VIPX将最大程度履行合理的注意义务，维护VIPX数据准确性，但由于互联网技术因素等客观原因，VIPX可能会出现网页显示信息滞后或差错现象， VIPX将将在发现后尽快进行修复。</p>
    <p>4.6 其他VIPX无法控制或合理预见的情形。</p>
    <p>5.VIPX仅对因VIPX原因给用户造成的直接、实际损失依法承担相应的赔偿责任，不对任何间接损失、惩罚性赔偿承担责任。</p>
    <h2>四、隐私政策</h2>
    <h3>（一）个人信息收集及使用</h3>
    <p>1. 收集信息类型及用途</p>
    <p>我们会出于本政策所述的以下目的，收集和使用您的个人信息：</p>
    <p>1.1为成为VIPX用户，便于我们为您提供服务，您需要提供基本注册或登录信息，包括手机号码、电子邮箱地址，并创建您的帐号、用户名和密码。</p>
    <p>在部分单项服务注册及登录过程中，如果您提供其他额外信息（例如您帐号所提供的年级、地区、学校、昵称、性别、籍贯、出生年月日、头像、兴趣爱好等），将有助于我们给您提供个性化的推荐和更优的服务体验，但如果您不提供这些信息，并不会影响您使用好未来服务的基本功能。同时，依照相关法律法规的要求或者特定功能及服务需要，您在使用特定功能及服务前，可能需要您提供其他信息（例如姓名、身份证、护照、驾驶证、面部特征及其他身份证明信息）。如果您不提供上述信息，我们将不能向您提供相关的功能及服务。如果您仅需使用浏览、搜索及查看VIPX官方主页及VIPX开放平台等基本服务及介绍，您不需要注册成为我们的会员及提供上述信息。成为VIPX用户后，客户可以对个人信息进行修改，如昵称、电话、生日、地区等。当您注销帐号时，我们将停止为您提供产品或服务，根据适用法律的要求删除您的个人信息，或使其匿名化处理。</p>
    <p>1.2为向您提供更契合您需求的服务，您会向我们提供信息并将这些信息进行关联，这些功能和信息包括：</p>
    <p>1.2.1产品预订/购买：您需要向VIPX提供联系人信息（姓名、性别、电话号码等）、地址信息（如涉及到需要邮寄教材、讲义等学习材料的服务时）等，以供VIPX为您在具体产品提供轻课、短期班、长期班等产品预订/购买服务。</p>
    <p>当您在VIPX旗下平台上使用配送/邮寄（例如教材、图书购买）服务时，您需要提供取\收货人的姓名、性别（用于配送人员联络时称呼您，如刘女士）、手机号码、收货地址、门牌号等，以便于您的订单能够安全准确送达并完成。您还可以选择为常用地址加注标签（如家、公司等），以便于此后的查找使用。</p>
    <p>1.2.2信息发布：您在VIPX旗下平台上主动对产品/服务进行评价或发布其他内容（如发表评论等信息）时，我们将收集您发布的信息，并展示您的昵称、头像和发布内容等。如您选择以匿名方式发布评价信息时，我们将不展示您的昵称、头像。您还可以通过主动上传图片、视频等方式授权访问您的相机、照片和麦克风，以便于您通过拍照、拍视频、上传照片或上传视频等方式发布内容。当您需要关闭该功能时，大多数移动设备都会支持您的这项需求，具体方法请参考或联系您移动设备的服务商或生产商。</p>
    <p>1.2.3支付：您在VIPX旗下平台上支付时，您可以选择VIPX合作的第三方支付机构（如微信支付、QQ钱包、Apple Pay、支付宝等支付通道）所提供的支付服务。支付功能本身并不收集您的个人信息，但我们需要将您的VIPX订单信息及对账信息与这些支付机构共享以确认您的支付指令并完成支付。</p>
    <p>1.2.4客服服务：当您与我们的客服取得联系时，我们的系统可能会记录您与客服之间的通讯记录，以及使用您的帐号信息以便核验身份；当您需要我们提供与您订单相关的客户服务时，我们可能会查询您的相关订单信息以便给予您适当的帮助和处理；当您需要客服协助您修改有关信息（如配送地址、联系方式等）时，您可能还需要提供上述信息外的其他信息以便完成修改。</p>
    <p>1.2.5代为购买VIPX服务：您可以通过VIPX旗下平台为其他人购买各类产品/服务，并提供该实际服务接收人的有关信息，您同意并确保此前请您已取得相关人的授权。</p>
    <p>1.2.6账单管理 为展示您帐号的订单信息，我们会收集您在使用我们服务过程中产生的订单信息用于向您展示及便于您对订单进行管理。您在VIPX生成的订单中，将可能包含您的身份信息、联络信息、地址信息、支付信息等，这些都属于敏感信息，请您谨慎向他人展示或对外提供，如VIPX需对外提供订单信息时，将取得您的授权，并尽到合理商业注意义务对您的信息进行去标识化处理以在最大化保护您的个人信息同时实现信息可用性。</p>
    <p>1.3 为向您提供更契合您需求的服务，我们会收集关于您使用产品、服务以及使用方式的信息并将这些信息进行关联，这些信息包括：</p>
    <p>1.3.1设备信息：我们会根据您在软件安装及使用中授予的具体权限，接收并记录您所使用的设备相关信息（例如设备型号、操作系统版本、设备设置、唯一设备标识符等软硬件特征信息）、设备所在位置相关信息（例如IP地址、GPS/北斗位置信息以及能够提供相关信息的Wi-Fi接入点、蓝牙和基站等传感器信息）。</p>
    <p>1.3.2日志信息：当您使用我们的网站或客户端提供的产品或服务时，我们会自动收集您对我们服务的详细使用情况，作为有关网络日志保存。例如您的搜索查询内容、IP地址、浏览器的类型、电信运营商、使用的语言、访问日期和时间、您访问的网页记录、通话状态信息等。</p>
    <p>1.3.3请注意，单独的设备信息、日志信息等是无法识别特定自然人身份的信息。如果我们将这类非个人信息与其他信息结合用于识别特定自然人身份，或者将其与个人信息结合使用，则在结合使用期间，这类非个人信息将被视为个人信息，除取得您授权或法律法规另有规定外，我们会将该类个人信息做匿名化、去标识化处理。</p>
    <p>1.3.4为展示您帐号的订单信息，我们会收集您在使用我们服务过程中产生的订单信息用于向您展示及便于您对订单进行管理。</p>
    <p>1.3.5当您与我们联系时，我们可能会保存您的通信/通话记录和内容或您留下的联系方式等信息，以便与您联系或帮助您解决问题，或记录相关问题的处理方案及结果。</p>
    <p>1.3.6为能向您提供更优质的服务，同时为能确认交易状态及为您提供售后与争议解决服务，经您授权后我们会通过您选择的交易对象和交易直接涉及的第三方信息系统、支付机构等收集与交易进度相关的您的交易、支付等信息，以便于我们处理您的订单并保证服务的顺利完成，或者更好地预防诈骗、刷单等恶意行为。我们会依据法律法规的要求以及与第三方的约定，以弹窗方式经您授权后从VIPX的关联公司、合作伙伴等获得您的有关信息，并对其信息来源的合法性进行确认后使用您的这些信息。如您在授权使用第三方帐号登录时，我们会从第三方获取您共享的帐号信息（如头像、昵称等），并在您同意本隐私政策后、在您使用相关功能时，将您的第三方帐号与VIPX帐号进行绑定。</p>
    <p>1.3为您提供安全保障</p>
    <p>为预防、发现、调查欺诈、侵权、危害安全、非法或违反与我们或与我们关联公司的协议、政策或规则的行为，我们可能收集或整合您的用户信息、服务使用信息、设备信息、日志信息以及我们关联公司、合作伙伴取得您授权或依据法律共享的信息。</p>
    <p>1.4 VIPX收集及使用上述信息的目的是为了更好地经营VIPX产品和服务（包括但不限于向您提供个性化的服务），我们将基于本政策未载明的其他特定目的收集您的信息时，会事先征求您的同意。如我们停止运营VIPX产品或服务，我们将及时停止继续收集您个人信息的活动，将停止运营的通知以逐一送达或公告的形式通知您，对所持有的个人信息进行删除或匿名化处理。</p>
    <p>2. 信息使用方式</p>
    <p>2.1收集您的信息是为了向您提供服务及提升服务质量，为了实现这一目的，我们会把您的信息用于下列用途：</p>
    <p>2.2向您提供您使用的VIPX产品或服务，并维护、改进、优化这些服务及服务体验；</p>
    <p>2.3为预防、发现、调查欺诈、侵权、危害安全、非法或违反与我们或与我们关联公司的协议、政策或规则的行为，保护您、其他用户或公众，我们或我们关联公司的合法权益，我们可能使用或整合您的用户信息、服务使用信息、设备信息、日志信息以及我们关联公司、合作伙伴取得您授权或依据法律共享的信息，来综合判断您帐号及交易风险、进行身份验证、检测及防范安全事件，并依法采取必要的记录、审计、分析、处置措施；</p>
    <p>2.4我们可能会将您的信息进行处理或者与来自其他服务的信息结合起来，用于为了向您提供更加个性化的服务使用，例如向您推荐可能感兴趣的内容，包括但不限于向您发出产品和服务信息，或通过系统向您展示个性化的第三方推广信息，或者在征得您同意的情况下与VIPX合作伙伴共享信息以便他们向您发送有关其产品和服务的信息；</p>
    <p>2.5经您许可的其他用途。</p>
    <h3>（二）Cookie 和同类技术使用</h3>
    <p>1.为使您获得更轻松的访问体验，您使用VIPX产品或服务时，我们可能会通过采用各种技术收集和存储您访问VIPX服务的相关数据，在您访问或再次访问VIPX服务时,我们能识别您的身份，并通过分析数据为您提供更好更多的服务。包括使用小型数据文件识别您的身份，这么做是为了解您的使用习惯，帮您省去重复输入帐号信息的步骤，或者帮助判断您的帐号安全。这些数据文件可能是Cookie、Flash Cookie，或您的浏览器或关联应用程序提供的其他本地存储（统称“Cookie”）。</p>
    <p>2.请您理解，我们的某些服务只能通过使用Cookie才可得到实现。如果您的浏览器或浏览器附加服务允许，您可以修改对Cookie的接受程度或者拒绝VIPX的Cookie，但拒绝VIPX的Cookie在某些情况下您可能无法使用依赖于cookies的VIPX服务的部分功能。</p>
    <p>3.网页上常会包含一些电子图像，称为“单像素 GIF 文件”或“网络 beacon”，它可以帮助网站计算浏览网页的用户或访问某些cookie。我们会通过网络beacon收集您浏览网页活动信息，例如您访问的页面地址、您先前访问的援引页面的位址、您停留在页面的时间、您的浏览环境以及显示设定等。</p>
    <h3>（三）信息的共享、转让、公开披露</h3>
    <p>1. 共享</p>
    <p>我们不会与VIPX服务提供者以外的公司、组织和个人共享您的个人信息，但以下情况除外：</p>
    <p>1.1在获取明确同意的情况下共享：获得您的明确同意后，我们会与其他方共享您的个人信息。</p>
    <p>1.2在法定情形下的共享：我们可能会根据法律法规规定、诉讼争议解决需要，或按行政、司法机关依法提出的要求，对外共享您的个人信息。</p>
    <p>1.3与关联公司间共享：为便于我们基于关联帐号共同向您提供服务，推荐您可能感兴趣的信息或保护VIPX关联公司或其他用户或公众的人身财产安全免遭侵害，您的个人信息可能会与我们的关联公司共享。我们只会共享必要的个人信息（如为便于您使用VIPX帐号使用我们关联公司产品或服务，我们会向关联公司共享您必要的帐号信息），如果我们共享您的个人敏感信息或关联公司改变个人信息的使用及处理目的，将再次征求您的授权同意。您同意关联公司与VIPX共享服务必要的相关信息。VIPX将准确记录和保存个人信息的共享、转让的情况，包括共享、转让的日期、规模、目的，以及数据接收方基本情况等。</p>
    <p>1.4与授权合作伙伴共享：仅为实现本隐私政策中声明的目的，我们的某些服务将由我们和授权合作伙伴共同提供。我们可能会与合作伙伴共享您的某些个人信息，以提供更好的客户服务和用户体验。例如，在您上网采购网站上的产品时，我们必须与物流服务提供商共享您的个人信息才能安排送货，或者安排合作伙伴提供服务。我们仅会出于合法、正当、必要、特定、明确的目的共享您的个人信息，并且只会共享提供服务所必要的个人信息。我们的合作伙伴无权将共享的个人信息用于与产品或服务无关的其他用途。</p>
    <p>1.5VIPX服务含有到其他网站的链接。除法律另有规定外，VIPX对其他网站的隐私保护措施不负任何责任。我们可能在任何需要的时候增加商业伙伴或共用品牌的网站，但是提供给他们的将仅是综合信息，我们将不会公开您的身份。</p>
    <p>1.6为了您的帐号安全，平台及其关联公司将建立好未来帐号安全中心，您在平台提供的以下信息将同步至好未来帐号安全中心。</p>
    <p>1.6.1同步的信息种类包含：手机号、您所上传的头像、昵称、您的姓名、英文名、性别、所在地区、在读学校、在读年级；</p>
    <p>1.6.2同步的平台/应用包含：已接入好未来帐号安全中心的由好未来集团网络及技术服务提供者通过下述途径向您提供的产品及服务：包括但不限于学而思、学而思网校、学而思轻课、爱智康、摩比思维、励步英语、顺顺留学、家长帮、大海1对1、VIPX等网站、客户端、相关微信开放平台帐号或小程序以及供第三方网站和应用程序使用的好未来软件开发工具包（SDK）和应用程序编程接口（API）、未设独立隐私政策的好未来集团关联公司提供的产品及服务等。以上平台/应用将逐步接入好未来账号安全中心。</p>
    <p>1.6.3接入好未来帐号安全中心后，您将享有如下权益：</p>
    <p>跨应用登录：在任意已接入好未来帐号安全中心的应用注册的帐号，均可登录已接入好未来帐号安全中心的全部应用 （以下“应用”均指“已接入好未来帐号安全中心的应用”）；</p>
    <p>快捷登录：在您未登录的应用中使用其他应用已登录帐号进行登录；</p>
    <p>安全管理：将您在应用进行的帐号的密码和绑定手机号修改操作在全部应用同步，您可使用修改后的信息登录任意应用。</p>
    <p>2.转让</p>
    <p>我们不会将您的个人信息转让给任何公司、组织和个人，但以下情况除外：</p>
    <p>2.1在获取明确同意的情况下转让：获得您的明确同意后，我们会向其他方转让您的个人信息。</p>
    <p>2.2在VIPX服务提供者发生合并、收购或破产清算情形，或其他涉及合并、收购或破产清算情形时，如涉及到个人信息转让，我们会要求新的持有您个人信息的公司、组织继续受本政策的约束，否则我们将要求该公司、组织和个人重新向您征求授权同意。</p>
    <p>3. 公开披露</p>
    <p>我们仅会在以下情况下，公开披露您的个人信息：</p>
    <p>3.1获得您明确同意或基于您的主动选择，我们可能会公开披露您的个人信息；</p>
    <p>3.2如果我们确定您出现违反法律法规或严重违反VIPX相关协议规则的情况，或为保护VIPX及其关联公司用户或公众的人身财产安全免遭侵害，我们可能依据法律法规或VIPX相关协议规则征得您同意的情况下披露关于您的个人信息，包括相关违规行为以及VIPX已对您采取的措施。</p>
    <p>4.共享、转让、公开披露个人信息时事先征得授权同意的例外</p>
    <p>以下情形中，共享、转让、公开披露您的个人信息无需事先征得您的授权同意：</p>
    <p>4.1与国家安全、国防安全有关的；</p>
    <p>4.2与公共安全、公共卫生、重大公共利益有关的；</p>
    <p>4.3与犯罪侦查、起诉、审判和判决执行等有关的；</p>
    <p>4.4出于维护您或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；</p>
    <p>4.5您自行向社会公众公开的个人信息；</p>
    <p>4.6从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道。</p>
    <p>4.7根据法律规定，共享、转让经去标识化处理的个人信息，且确保数据接收方无法复原并重新识别个人信息主体的，不属于个人信息的对外共享、转让及公开披露行为，对此类数据的保存及处理将无需另行向您通知并征得您的同意。</p>
    <h3>（四）信息的保护</h3>
    <p>我们会采取各种预防措施来保护您的个人信息，以保障您的个人信息免遭丢失、盗用和误用，以及被擅自取阅、披露、更改或销毁。为确保您个人信息的安全，我们有严格的信息安全规定和流程，并有专门的信息安全团队在公司内部严格执行上述措施。</p>
    <p>VIPX有行业先进的以数据为核心，围绕数据生命周期进行的数据安全管理体系，从组织建设、制度设计、人员管理、产品技术等方面多维度提升整个系统的安全性。</p>
    <p>我们会采取合理可行的措施，尽力避免收集无关的个人信息，并在限于达成本政策所述目的所需的期限内保留您的个人信息，除非需要延长保留期限或在法律的允许期限内。</p>
    <p>在不幸发生个人信息安全事件后，我们将按照法律法规的要求【并最迟不迟于30 个自然日内】向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。事件相关情况我们将以邮件、信函、电话、推送通知等方式告知您，难以逐一告知个人信息主体时，我们会采取合理、有效的方式发布公告。同时，我们还将按照监管部门要求，上报个人信息安全事件的处置情况。</p>
    <p>互联网环境并非百分之百安全，尽管我们有这些安全措施，但请注意在互联网上不存在“完善的安全措施”，我们将尽力确保您的信息的安全性。</p>
    <h3>（五）未成年人保护</h3>
    <p>我们重视未成年人的信息保护，如您为未成年人的，建议您请您的父母或监护人仔细阅读本隐私权政策，并在征得您的父母或监护人同意的前提下使用我们的服务或向我们提供信息。对于经父母或监护人同意使用我们的产品或服务而收集未成年人个人信息的情况，我们只会在法律法规允许，父母或监护人明确同意或者保护未成年人所必要的情况下使用，共享，转让或披露此信息。我们将根据国家相关法律法规及本政策的规定保护未成年人的个人信息。</p>
    <h3>（六）您的个人信息如何在全球范围转移</h3>
    <p>原则上，我们在中华人民共和国境内运营中收集和产生的个人信息，存储在中国人民共和国境内。就中华人民共和国境外VIPX用户使用VIPX产品及服务过程中产生的个人信息，您同意回传存储在中国境内的服务器上，否则您无法使用现有VIPX的产品及服务。在此类情况下，我们会确保您的个人信息得到在中华人民共和国境内足够同等的保护。</p>
    <h3>（七）信息变更</h3>
    <p>用户信息变更：您可以在APP上进行个人信息的变更（包括手机号、姓名、头像、性别、地区，收货地址等信息），如有任何问题，您可以通过VIPX的在线服务或电话服务渠道联系我们，帮您解决问题。</p>
    <p>用户信息删除：您可以通过VIPX的在线服务或电话服务渠道联系我们，提供相关信息后，我们会帮您删除用户信息。</p>
    <p>用户帐号注销：您可以通过VIPX的在线服务或电话服务渠道联系我们，提供相关信息后，我们会帮您注销帐号。</p>
    <h2>五、知识产权</h2>
    <p>1. VIPX及其关联公司是本平台的知识产权权利人。本平台的一切著作权、商标权、专利权、商业秘密等知识产权，以及与本平台相关的所有信息内容（包括但不限于文字、图片、音频、视频、图表、界面设计、版面框架、有关数据或电子文档等）均受中华人民共和国大陆地区法律法规和相应的国际条约保护，VIPX或其关联公司享有上述知识产权，但相关权利人依照法律规定应享有的权利除外。</p>
    <p>2.未经平台书面同意，上述资料均不得在任何媒体直接或间接发布、播放、出于播放或发布目的而改写或再发行, 或者被用于其他任何商业目的。所有以上资料或资料的任何部分仅可作为私人和非商业用途保存。</p>
    <h2>六、其他</h2>
    <p>1.本政策所有条款的标题仅为阅读方便，不作为本政策涵义解释或限制的依据。</p>
    <p>2.本政策任一条款被视为废止、无效或不可执行，该条应视为可分的且并不影响本政策其余条款的有效性及可执行性。</p>
    <p>3.本政策可能存在包括中文、英文在内的多种语言的版本，如果存在中文版本与其他语言的版本相冲突的地方，以中文版本为准。</p>
    <p>4.针对某些特定的产品及服务，我们还将制定特定的隐私政策，并在向您提供这些特定的产品及服务之前加以说明。如相关特定的隐私政策与本隐私政策不一致的，适用该特定隐私政策。</p>
    <h2>七、法律适用与管辖</h2>
    <p>1.本政策之订立、生效、解释、修订、补充、终止、执行与争议解决均适用中华人民共和国大陆地区法律。如法律无相关规定的，参照商业惯例及/或行业惯例。</p>
    <p>2.您因使用VIPX服务所产生及与VIPX服务有关的争议，由VIPX与您协商解决。协商不成时，任何一方均可向北京市海淀区人民法院提起诉讼。</p>
    <h2>八、与我们联系</h2>
    <p>当您有其他的投诉、建议等相关问题时，可以通过如下方式与我们联系，我们将尽快审核所涉及内容：</p>
    <p>平台运营主体名称：北京学而思教育科技有限公司</p>
    <p>联系地址：北京市海淀区中关村大街18号科贸中心7层</p>
    <p>联系电话：400-800-2211</p>
  </div>
</template>
<style lang="less" scoped>
@import '../../styles/basic.less';
.agreement{
  padding:0.4rem;
  color:@col-darkgray;
  h1{
    text-align:center;
    font-size: 0.32rem;
    margin:0.3rem 0;
  }
  h2{
    font-size: 0.28rem;
    font-weight: bold;
    padding:0.4rem 0 0.1rem 0;
  }
  p{
    line-height: 0.5rem;
    font-size: 0.26rem;
  }
}
</style>
