<template>
  <div class="protocol-modal">
    <div class="modal-header" v-if="agreement !== 2">
      <em class="icon-smile"></em><span class="tips">请仔细阅读购课协议，在协议最下方点击确认按钮确认~</span>
    </div>
    <div class="modal-body">
      <!--新规则-->
      <div v-if="newOrOld===1">
        <p>VIPX课程购买协议</p>
        <p>如有任何问题 </p>
        <p>请致电 4008002211转9 </p>
        <p>或者联系您的课程顾问 </p>
        <p>本协议中，“甲方”是指购买乙方相应课程的自然人；“乙方”是指“北京学而思教育科技有限公司 ”。 </p>
        <br>
        <h3>第一部分 课程信息 </h3>
        <p>课程基本信息：以乙方官网中甲方账号下的订单信息为准。 </p>
        <br>
        <h3>第二部分 本协议的签署和生效 </h3>
        <p>1. 本协议内容包括本协议正文所载之各条款及乙方网站（www.vipx.com）已经发布的或将来可能发布的各类课程规则、服务规则（下称“乙方网站规则”）；所有该等乙方网站规则均为本协议不可分割的一部分，与本协议正文具有同等法律效力。本协议是甲方与乙方自愿共同签订的，适用于甲方在乙方网站的全部活动。 </p>
        <p>2. 甲方在注册乙方网站时，应当详实登录个人正确、完整的信息（包括真实姓名及各项相关资料）。如因甲方提供的资料不实或者不明确，致使任何一方受到任何延误或者损失的，应当由甲方承担相应责任。 </p>
        <p>3. 在甲方购买乙方课程时，甲方应已年满 18 岁，且已经阅读、理解并接受本协议正文的全部条款及乙方网站规则，并承诺阅读、理解并接受乙方网站不时发布的乙方网站规则。甲方确认在已知悉并接受本协议的前提下支付课程费用。一旦甲方在乙方网站上完成课程购买并支付相应费用，即意味着甲方已阅读本协议所有条款，并对本协议条款的含义已充分理解，同意受本协议约束。 </p>
        <p>4. 本协议中的“学员”或者“甲方学员”是指在乙方的官方网站中甲方的注册账户下学习甲方所购买的课程包的一名固定学员。乙方按照该学员个人的学习状况和知识储备情况确定其起始级别并配备相应课程内容，为确保最佳的学习效果，整个学习过程中不得更换或者增加学员。 </p>
        <p>5. 通过甲方账号在乙方网站发生的课程购买行为均视为甲方本人的真实意思表示和甲方本人的行为，本协议自乙方收到甲方支付的课程费用起生效，一经成立生效即不可撤销。 </p>
        <br>
        <h3>第三部分 课程服务 </h3>
        <p>1. 乙方为报名HE课程的学员提供一对一的外教在线视频教学服务，每个学习周包含一次一对一课程；乙方为报名Reach课程的学员提供一对一和一对多的外教在线视频教学服务，每个学习周包含一次一对一课程和一对多课程。每节课的时长为 40 分钟。</p>
        <p>2. 乙方将根据学员情况为其确定起始年级和级别，学员及其家长同意全部课程从该级别开始。 </p>
        <p>3. 每次一对一课程结束12小时后,该次课程的视频录像将上传至乙方网站,甲方可以在用账户登陆后查看课程视频。 </p>
        <p class="red">4. 按照已经生成的学员课表信息，如果学员无法在预定时间上一对一在线外教课， 距当节课预先安排上课时间>=24小时可调课；若距当节课预先安排的上课时间＜24小时,则不可调课。每个学员每个学期有3次调课机会。</p>
        <p class="red">5. 学员未能在预定时间进入教室进行上课的，课程将按时开始和结束，学员及甲方不能要求课程延时。 学生缺席或未到，乙方将正常扣除该节的课时。学员及甲方不得要求乙方提供补课。</p>
        <p>6. 如由于乙方的原因（包括但不限于乙方提供的教师临时无法授课、中途因故中止授课、乙方的授课系统出现故障等）导致甲方无法完成预约课程的，该次课程将不被扣除课时。 </p>
        <br>
        <h3>第四部分 费用支付和课程退费 </h3>
        <p>1. 甲方根据本协议向乙方支付课程费用后，按照乙方的时间安排，甲方购买的课程尚未开始，则甲方可随时向乙方申请退还全部课程费用。 </p>
        <p>2. 甲方根据本协议向乙方支付课程费用后, 如果按照乙方的安排，已经开始上课： </p>
        <p class="red">（1） 如果甲方购买乙方同一级别的课程服务，且甲方学员实际被扣除的一对一课程课时小于或等于 1 节，甲方可向乙方申请一次全额退款；</p>
        <p class="red">（2） 如未能满足本条第（1）款所述条件，或，甲方购买乙方课程服务，且消耗课时大于等于2次课以上，甲方向乙方申请退款，则乙方将根据甲方实际扣除的课程周数量（课程周数量按一对一课程为准）与课单价原价的乘积计算应向甲方收取的课程费用。即，乙方向甲方退还的金额按照如下公式计算： </p>
        <p class="red">应退金额 = 实际缴费课程金额 - 课单价（见备注1） ✖️ 实际消耗课次</p>
        <p class="red">备注：</p>
        <p class="red">i. 课单价 = ( 订单实际缴费金额 - 教材费 ) /  购买课节数</p>
        <p class="red">ii. 如若甲方购买订单中未购买教材，则该订单中的教材费为0元。</p>
        <p class="red">iii. 甲方在操作退费时，若最近一次课离上课时间小于24小时，该课节不予退费</p>
        <p class="red">3. 甲方根据本协议向乙方支付课程费用时，若购买了教材，在发生退费时规则如下：</p>
        <p class="red">（1）以甲方购买成功当天计算，30天内且教材未拆封，可操作退费。</p>
        <p class="red">（2）以甲方购买成功当天计算，超过30天，则不可操作退费。</p>
        <p class="red">（3）若教材已拆封，则不可操作退费。</p>
        <p>4. 退款时，甲方须自费提供并交回已经开具的发票。如不能提供乙方开具的发票，乙方有权从退款中直接扣除发票金额的 8%，以支付当地发票税赋和相关费用。 </p>
        <p>退款流程和时间通常为批准退款申请日起 2 至 3 周，乙方将按照交款时的方式和账号进行退款。 </p>
        <p>5. 乙方向甲方赠送的所有课程（如有）将在甲方购买的全部课程使用完毕以后方能开始使用。如甲方申请退费，甲方在购买课程时赠送的全部课程、优惠等项目将自动取消。 </p>
        <br>
        <h3>第五部分 双方的权利义务 </h3>
        <p>1. 甲方的权利和义务： </p>
        <p>（1） 甲方及学员不得影响乙方网站的正常运营，不得影响课程进程及其他学员的学习活动。 </p>
        <p>（2） 甲方及学员在课程学习期内，如遇有任何问题，可以随时与乙方的工作人员取得联系。 </p>
        <p>（3） 甲方及学员不得发布不实言论损害乙方或乙方员工的名誉。 </p>
        <p>（4） 在任何情况下，甲方及学员不得以任何方式出售或转让乙方提供的全部或部分培训课程。 </p>
        <p>（5） 甲方同意自行配备宽带上网设备及其他学习乙方课程所需软件和硬件设备。</p>
        <p>（6） 为保护所有注册人及学员的权益，甲方不得利用乙方网站及系统平台搜集、探询、索取其他学员及学员家长以及老师之个人信息、联络方式(例如电子邮件信箱、QQ 账号、Wechat 账号、微博等)、交友及财务状况等等。 </p>
        <p>2. 乙方的权利和义务： </p>
        <p>(1) 在保证培训质量的前提下，乙方有权改进、调整变更其培训服务、课程安排或其他事项。但乙方应将上述任何变更通过网站或本协议中列明的联系方式及时通知甲方。 </p>
        <p>(2) 乙方应根据甲方提出的要求，在约定范围内提供相应技术支持服务，并及时回应甲方提出的问题和意见。 </p>
        <br>
        <h3>第六部分 个人信息及保密 </h3>
        <p>1. 为便于乙方了解学员情况、更好地履行本协议项下义务，甲方应向乙方提供学员的部分个人信息。甲方同意乙方可将学员的个人信息用于公司内部的教学管理等目的，但应注意依法严格保护学员的个人隐私。 </p>
        <p>2. 如甲方提供的学员信息发生变更，甲方应及时通知乙方课程顾问；由于甲方未及时通知的而导致乙方无法联系到甲方、使学员的学习受到影响的，甲方应自行承担责任。 </p>
        <p>3. 甲方同意应妥善保管其课程账户和密码，并对任何人利用其账户和密码所进行的活动负责。如学员的账户和密码遭到未获授权的使用，或者发生其他任何安全问题，甲方应立即通知乙方的工作人员，要求乙方工作人员暂停相关服务。甲方亦不得将其账号和密码出借、转移或者让与第三人使用。如乙方合理怀疑甲方违反本约定，乙方有权暂时停止甲方账户之使用，如果乙方最终确认甲方违反本约定，乙方有权立即终止本协议。 </p>
        <p>4. 未经乙方书面同意及授权，甲方不得以任何方式将因本协议之订立或执行所得悉的乙方之技术数据、商业秘密及其他机密资料和信息提供给任何第三人或向第三人披露，如有违反，乙方有权立即终止本协议并要求甲方赔偿其损失。</p>
        <br>
        <h3>第七部分 知识产权 </h3>
        <p>1. 以下所述资料的所有权及全部、完整的知识产权归乙方享有：（1）乙方为培训课程所制作的全部资料（包括但不限于教材教辅、课件及教学相关材料等）；（2）在教学过程中产生的全部资料（包括但不限于任何教学视频、教学方案等）；（3）乙方网站上所显示、使用或提供之软件、程序及内容。未经乙方同意，甲方及学员在任何时候（包括本协议有效期内及协议终止后）均不得：为商业目的对上述资料进行利用；以任何方式翻译、复制、传播、编辑上述资料；以及将上述资料透露给任何第三方。 </p>
        <p>2. 甲方同意，在甲方学员参与的培训课程中，或甲方及学员参与乙方组织、举办的其他活动中， 乙方可以进行拍照、摄像、录音、录像等记录活动。乙方对上述记录活动过程中所产生的作品、录音录像制品等单独地享有全部、完整的知识产权。乙方同意依法为甲方及学员的个人信息采取严格的保密措施。未经甲方同意，乙方不得将上述包含甲方及学员肖像或者显示个人身份的其他个人信息进行公开地商业使用。仅当以下情况之一发生时，乙方可以对甲方的肖像、姓名等个人信息进行合理使用，乙方无须再单独取得甲方同意，也无须向甲方支付任何费用：（1）甲方及学员的肖像、姓名等合法民事权益，已被明确放弃；（2）为乙方内部的展示/使用需要，包括但不限于在内部会议中展示、将相关资料作为历史档案留存于乙方档案库或者服务器上等。 </p>
        <br>
        <h3>第八部分 禁止劝诱 </h3>
        <p>1. 乙方的员工、老师（包括北美外教和中国老师）为其公司存续及发展的重要支撑力量，任何人非经乙方同意不得在使用乙方课程中及课程结束后，以任何方式劝诱、要求、或者邀请乙方的员工或者老师与乙方终止或者解除服务关系，或劝诱、要求、或者邀请乙方的员工或者老师接受由甲方自己或者甲方介绍的其他个人或组织提供（无论正式、兼职、或者临时组织的活动）的任何职务。 如有违反，甲方应当向乙方承担违约金，违约金的金额为上述人员离职前所在的乙方岗位上一年度年薪或报酬的两（2）倍。 </p>
        <br>
        <h3>第九部分 违约责任 </h3>
        <p>1. 本协议任何一方违约，均应承担违约责任，对另一方因此产生的损失承担赔偿责任。 </p>
        <p>2. 如果乙方违约，甲方有权随时以通知乙方的方式终止本协议，并要求乙方按照本协议第五部分约定的退费方式进行退费。给甲方造成损失的，乙方应当承担相应违约责任，乙方因未能履行本协议项下的义务而需承担的全部责任的上限为甲方学员支付的课程费用总额。 </p>
        <p>3. 如果甲方违约，乙方有权随时以通知乙方的方式终止本协议，甲方的违约行为给乙方造成损失的，乙方有权先行在甲方已经支付但尚未使用的课程费用中扣除相应金额。 </p>
        <br>
        <h3>第十部分 其他事项 </h3>
        <p>1. 在甲方的课程到期结束后，本协议自动终止，甲方所拥有的课程账号同时失效。但本协议的终止不影响第六部分、第七部分和第八部分有关保密知识产权及禁止劝诱条款的效力。 </p>
        <p>2. 乙方有权不时根据课程和管理改进的需要对本协议及网站的内容进行修改，并在网站中公布。修改后的协议一旦被张贴在乙方网站上即生效，并代替原来的协议，甲方可随时登录查阅最新协议。如甲方不同意更新后的协议，应立即书面通知乙方并立即停止接受乙方依据本协议提供的服务；如甲方未在 2 个工作日内书面通知乙方或用户继续使用乙方提供的服务的，即视为同意更新后的协议。 </p>
        <p>3. 协议经甲方确认并同意后，将以电子文件方式留存于乙方公司系统中，以为双方协议签署及遵循的依据。 </p>
        <p>4. 如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，本协议的其余条款仍应有效并且有约束力。 </p>
        <br>
        <h3>第十一部分 法律管辖和争议解决 </h3>
        <p>1. 本协议的订立、执行和解释及争议的解决均应适用中华人民共和国法律（不包括特别行政区及台湾地区法律）。 </p>
        <p>2. 协议中未尽事宜，双方依据乙方公司网站（www.vipx.com）的公示内容为准。如有任何争议， 双方应当尽量友好协商解决。协商不成，双方同意将争议提交至北京仲裁委员会进行仲裁解决。</p>
      </div>
      <!--老规则-->
      <div v-else>
        <p>VIPX课程购买协议</p>
        <p>如有任何问题</p>
        <p>请致电 4008002211转9</p>
        <p>或者联系您的课程顾问</p>
        <p>本协议中，“甲方”是指购买乙方相应课程的自然人；“乙方”是指“北京学而思教育科技有限公司 ”。</p>
        <br />

        <h3>第一部分 课程信息</h3>
        <p>课程基本信息：以乙方官网中甲方账号下的订单信息为准。</p>
        <br />

        <h3>第二部分 本协议的签署和生效</h3>
        <p>1. 本协议内容包括本协议正文所载之各条款及乙方网站（www.vipx.com）已经发布的或将来可能发布的各类课程规则、服务规则（下称“乙方网站规则”）；所有该等乙方网站规则均为本协议不可分割的一部分，与本协议正文具有同等法律效力。本协议是甲方与乙方自愿共同签订的，适用于甲方在乙方网站的全部活动。</p>
        <p>2. 甲方在注册乙方网站时，应当详实登录个人正确、完整的信息（包括真实姓名及各项相关资料）。如因甲方提供的资料不实或者不明确，致使任何一方受到任何延误或者损失的，应当由甲方承担相应责任。</p>
        <p>3. 在甲方购买乙方课程时，甲方应已年满 18 岁，且已经阅读、理解并接受本协议正文的全部条款及乙方网站规则，并承诺阅读、理解并接受乙方网站不时发布的乙方网站规则。甲方确认在已知悉并接受本协议的前提下支付课程费用。一旦甲方在乙方网站上完成课程购买并支付相应费用，即意味着甲方已阅读本协议所有条款，并对本协议条款的含义已充分理解，同意受本协议约束。</p>
        <p>4. 本协议中的“学员”或者“甲方学员”是指在乙方的官方网站中甲方的注册账户下学习甲方所购买的课程包的一名固定学员。乙方按照该学员个人的学习状况和知识储备情况确定其起始级别并配备相应课程内容，为确保最佳的学习效果，整个学习过程中不得更换或者增加学员。</p>
        <p>5. 通过甲方账号在乙方网站发生的课程购买行为均视为甲方本人的真实意思表示和甲方本人的行为，本协议自乙方收到甲方支付的课程费用起生效，一经成立生效即不可撤销。</p>
        <br />
        <h3>第三部分 课程服务</h3>
        <p>1. 乙方为报名HE课程的学员提供一对一的外教在线视频教学服务，每个学习周包含一次一对一课程；乙方为报名Reach课程的学员提供一对一和一对多的外教在线视频教学服务，每个学习周包含一次一对一课程和一对多课程。每节课的时长为 40 分钟。</p>
        <p>2. 乙方将根据学员情况为其确定起始年级和级别，学员及其家长同意全部课程从该级别开始。</p>
        <p>3. 每次一对一课程结束12小时后,该次课程的视频录像将上传至乙方网站,甲方可以在用账户登陆后查看课程视频。</p>
        <p class="red">4. 如果学员无法在预定时间上一对一在线外教课，请务必至少提前15分钟调课,若未能提前15分钟调课，乙方将会扣除相应的课时。每个学员每个学期有3次调课机会。</p>
        <p class="red">5. 学员未能按时进入教室进行上课的，课程将按时开始和结束，学员及甲方不能要求课程延时。</p>
        <p>6. 如由于乙方的原因（包括但不限于乙方提供的教师临时无法授课、中途因故中止授课、乙方的授课系统出现故障等）导致甲方无法完成预约课程的，该次课程将不被扣除课时。</p>
        <br />
        <h3>第四部分 费用支付和课程退费</h3>
        <p>1. 甲方根据本协议向乙方支付课程费用后，按照乙方的时间安排，甲方购买的课程尚未开始，则甲方可随时向乙方申请退还全部课程费用。</p>
        <p>2. 甲方根据本协议向乙方支付课程费用后, 如果按照乙方的安排，已经开始上课：</p>
        <p class="red">（1） 如果甲方为首次购买乙方的课程服务，且甲方学员实际被扣除的一对一课程数量小于或等于 1 节，甲方可向乙方申请退还全部课程费用；</p>
        <p class="red">（2） 如未能满足本条第（1）款所述条件，或，甲方并非首次购买乙方课程服务，甲方向乙方申请退款，则乙方将根据甲方实际扣除的课程周数量（课程周数量按一对一课程为准）与课单价原价的乘积计算应向甲方收取的课程费用。即，乙方向甲方退还的金额按照如下公式计算：
  应退金额 = 实际缴费金额 - 课单价原价（Reach课程课单价原价为270元；HE课程课单价原价为192元）x 实际消耗课次</p>
        <p class="red">3. 甲方根据本协议向乙方支付课程费用时，若同时购买了教材，在发生退费时规则如下：</p>
        <p class="red">（1）若教材未发货，则教材费可退；</p>
        <p class="red">（2）若教材已签收，则教材费不可退；</p>
        <p class="red">甲方根据本协议向乙方支付课程费用时，如获赠且勾选了免费教材，在发生退费时规则如下：</p>
        <p class="red">（1）若教材未发货，则无需扣除教材费；</p>
        <p class="red">（2）若教材已签收，且甲方实际消耗的课程周数量小于10周课，则需要扣除教材费，即按如下公式计算：</p>
        <p class="red">应退金额 = 实际缴费金额 - 课单价原价（270元）x 实际消耗课次-教材价格（599元）；</p>
        <p class="red">（3）若教材已签收，且甲方实际消耗的课程周数量大于或等于10周课，则无需扣除教材费</p>
        <p>4. 退款时，甲方须自费提供并交回已经开具的发票。如不能提供乙方开具的发票，乙方有权从退款中直接扣除发票金额的 8%，以支付当地发票税赋和相关费用。</p>
        <p>退款流程和时间通常为批准退款申请日起 2 至 3 周，乙方将按照交款时的方式和账号进行退款。</p>
        <p>5. 乙方向甲方赠送的所有课程（如有）将在甲方购买的全部课程使用完毕以后方能开始使用。如甲方申请退费，甲方在购买课程时赠送的全部课程、优惠等项目将自动取消。</p>
        <br />
        <h3>第五部分 双方的权利义务</h3>
        <p>1. 甲方的权利和义务：</p>
        <p>（1） 甲方及学员不得影响乙方网站的正常运营，不得影响课程进程及其他学员的学习活动。</p>
        <p>（2） 甲方及学员在课程学习期内，如遇有任何问题，可以随时与乙方的工作人员取得联系。</p>
        <p>（3） 甲方及学员不得发布不实言论损害乙方或乙方员工的名誉。</p>
        <p>（4） 在任何情况下，甲方及学员不得以任何方式出售或转让乙方提供的全部或部分培训课程。</p>
        <p>（5） 甲方同意自行配备宽带上网设备及其他学习乙方课程所需软件和硬件设备。</p>
        <p>（6） 为保护所有注册人及学员的权益，甲方不得利用乙方网站及系统平台搜集、探询、索取其他学员及学员家长以及老师之个人信息、联络方式(例如电子邮件信箱、QQ 账号、Wechat 账号、微博等)、交友及财务状况等等。</p>
        <p>2. 乙方的权利和义务：</p>
        <p>(1) 在保证培训质量的前提下，乙方有权改进、调整变更其培训服务、课程安排或其他事项。但乙方应将上述任何变更通过网站或本协议中列明的联系方式及时通知甲方。</p>
        <p>(2) 乙方应根据甲方提出的要求，在约定范围内提供相应技术支持服务，并及时回应甲方提出的问题和意见。</p>
        <br>

        <h3>第六部分 个人信息及保密</h3>
        <p>1. 为便于乙方了解学员情况、更好地履行本协议项下义务，甲方应向乙方提供学员的部分个人信息。甲方同意乙方可将学员的个人信息用于公司内部的教学管理等目的，但应注意依法严格保护学员的个人隐私。</p>
        <p>2. 如甲方提供的学员信息发生变更，甲方应及时通知乙方课程顾问；由于甲方未及时通知的而导致乙方无法联系到甲方、使学员的学习受到影响的，甲方应自行承担责任。</p>
        <p>3. 甲方同意应妥善保管其课程账户和密码，并对任何人利用其账户和密码所进行的活动负责。如学员的账户和密码遭到未获授权的使用，或者发生其他任何安全问题，甲方应立即通知乙方的工作人员，要求乙方工作人员暂停相关服务。甲方亦不得将其账号和密码出借、转移或者让与第三人使用。如乙方合理怀疑甲方违反本约定，乙方有权暂时停止甲方账户之使用，如果乙方最终确认甲方违反本约定，乙方有权立即终止本协议。</p>
        <p>4. 未经乙方书面同意及授权，甲方不得以任何方式将因本协议之订立或执行所得悉的乙方之技术数据、商业秘密及其他机密资料和信息提供给任何第三人或向第三人披露，如有违反，乙方有权立即终止本协议并要求甲方赔偿其损失。</p>
        <br>

        <h3>第七部分 知识产权</h3>
        <p>1. 以下所述资料的所有权及全部、完整的知识产权归乙方享有：（1）乙方为培训课程所制作的全部资料（包括但不限于教材教辅、课件及教学相关材料等）；（2）在教学过程中产生的全部资料（包括但不限于任何教学视频、教学方案等）；（3）乙方网站上所显示、使用或提供之软件、程序及内容。未经乙方同意，甲方及学员在任何时候（包括本协议有效期内及协议终止后）均不得：为商业目的对上述资料进行利用；以任何方式翻译、复制、传播、编辑上述资料；以及将上述资料透露给任何第三方。</p>
        <p>2. 甲方同意，在甲方学员参与的培训课程中，或甲方及学员参与乙方组织、举办的其他活动中， 乙方可以进行拍照、摄像、录音、录像等记录活动。乙方对上述记录活动过程中所产生的作品、录音录像制品等单独地享有全部、完整的知识产权。乙方同意依法为甲方及学员的个人信息采取严格的保密措施。未经甲方同意，乙方不得将上述包含甲方及学员肖像或者显示个人身份的其他个人信息进行公开地商业使用。仅当以下情况之一发生时，乙方可以对甲方的肖像、姓名等个人信息进行合理使用，乙方无须再单独取得甲方同意，也无须向甲方支付任何费用：（1）甲方及学员的肖像、姓名等合法民事权益，已被明确放弃；（2）为乙方内部的展示/使用需要，包括但不限于在内部会议中展示、将相关资料作为历史档案留存于乙方档案库或者服务器上等。 </p>
        <br>

        <h3>第八部分 禁止劝诱</h3>
        <p>1. 乙方的员工、老师（包括北美外教和中国老师）为其公司存续及发展的重要支撑力量，任何人非经乙方同意不得在使用乙方课程中及课程结束后，以任何方式劝诱、要求、或者邀请乙方的员工或者老师与乙方终止或者解除服务关系，或劝诱、要求、或者邀请乙方的员工或者老师接受由甲方自己或者甲方介绍的其他个人或组织提供（无论正式、兼职、或者临时组织的活动）的任何职务。 如有违反，甲方应当向乙方承担违约金，违约金的金额为上述人员离职前所在的乙方岗位上一年度年薪或报酬的两（2）倍。</p>
        <br>

        <h3>第九部分 违约责任</h3>
        <p>1. 本协议任何一方违约，均应承担违约责任，对另一方因此产生的损失承担赔偿责任。</p>
        <p>2. 如果乙方违约，甲方有权随时以通知乙方的方式终止本协议，并要求乙方按照本协议第五部分约定的退费方式进行退费。给甲方造成损失的，乙方应当承担相应违约责任，乙方因未能履行本协议项下的义务而需承担的全部责任的上限为甲方学员支付的课程费用总额。</p>
        <p>3. 如果甲方违约，乙方有权随时以通知乙方的方式终止本协议，甲方的违约行为给乙方造成损失的，乙方有权先行在甲方已经支付但尚未使用的课程费用中扣除相应金额。</p>
        <br>

        <h3>第十部分 其他事项</h3>
        <p>1. 在甲方的课程到期结束后，本协议自动终止，甲方所拥有的课程账号同时失效。但本协议的终止不影响第六部分、第七部分和第八部分有关保密知识产权及禁止劝诱条款的效力。</p>
        <p>2. 乙方有权不时根据课程和管理改进的需要对本协议及网站的内容进行修改，并在网站中公布。修改后的协议一旦被张贴在乙方网站上即生效，并代替原来的协议，甲方可随时登录查阅最新协议。如甲方不同意更新后的协议，应立即书面通知乙方并立即停止接受乙方依据本协议提供的服务；如甲方未在 2 个工作日内书面通知乙方或用户继续使用乙方提供的服务的，即视为同意更新后的协议。</p>
        <p>3. 协议经甲方确认并同意后，将以电子文件方式留存于乙方公司系统中，以为双方协议签署及遵循的依据。</p>
        <p>4. 如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，本协议的其余条款仍应有效并且有约束力。</p>
        <br>

        <h3>第十一部分 法律管辖和争议解决</h3>
        <p>1. 本协议的订立、执行和解释及争议的解决均应适用中华人民共和国法律（不包括特别行政区及台湾地区法律）。</p>
        <p>2. 协议中未尽事宜，双方依据乙方公司网站（www.vipx.com）的公示内容为准。如有任何争议， 双方应当尽量友好协商解决。协商不成，双方同意将争议提交至北京仲裁委员会进行仲裁解决。</p>
      </div>

      
      
      <template v-if="agreement !== 2">
        <x-button class="agree btn-purple" @click.native="close()" v-if="time < 1 || agreement">
          我已阅读并同意
        </x-button>
        <x-button class="agree btn-disable" v-else>
          我已阅读并同意{{time}}s
        </x-button>
      </template>
    </div>
  </div>
</template>
<script>
  import moment from 'moment';
  import { XButton } from 'vux';
  // 购课协议弹窗组件
  export default {
    components: {
      XButton,
    },
    name: 'BuyProtocol',
    props: {
      agreement: {
        type: Number,
        default: 0,
      },
      created_at: {
        type: String,
        default: '',
      },
    },
    data() {
      return {
        time: 10,
      };
    },
    computed: {
      newOrOld() {
        let agreeType = 2;
        if (this.created_at !== '') {
          if (moment(this.created_at).isAfter('2019-05-04 23:00:00')) {
            agreeType = 1;
          }
        } else if (moment().isAfter('2019-05-04 23:00:00')) {
          agreeType = 1;
        }
        return agreeType;
      },
    },
    methods: {
      close() {
        this.$emit('close');
      },
      moment(date) {
        return moment(date);
      },
    },
    mounted() {
      if (this.agreement) {
        return;
      }
      const timer = setInterval(() => {
        this.time -= 1;
        if (this.time < 1) {
          clearInterval(timer);
        }
      }, 1000);
    },
  };
 </script>

 <style scoped lang="less">
 @import '../../styles/basic.less';

 .protocol-modal {
    z-index: 100;
    position: fixed;
    top: 0;
    left: 0;
    width: 100%;
    height: 100%;
    background-color: rgba(255, 255, 255, 1);
    .modal-header {
      position: relative;
      text-align: left;
      line-height: .4rem;
      background-color: #FFF3E1;
      color: #FFA000;
      font-size: .26rem;
      font-weight: medium;
      padding: .15rem 0 .15rem .6rem;
      .icon-smile{
        position: absolute;
        .wh(.3rem, .3rem);
        .bg-m('@{img-path}/smile-face.png');
        background-size:  .3rem .3rem;
        top: .2rem;
        left: .2rem;
      }
    }
    .close {
      position: absolute;
      top: .18rem;
      right: 0;
      display: inline-block;
      width: .3rem;
      height: .3rem;
      background-image: url('../../assets/close.png');
      background-size:  .3rem .3rem;
    }
    .gap {
      width: 4.68rem;
      height: .01rem;
      margin: 0 auto;
      background: rgb(236,232,231);
    }
    .modal-body {
      height: 95%;
      padding: .29rem .32rem .54rem;
      font-size: .26rem;
      color: #1a1a1a;
      overflow-y: scroll;
      p{
        text-align: left;
        &.red{
          color: red;
        }
      }
      h3{
        font-weight: 500;
        text-align: left;
      }
      .agree{
        margin-top: .30rem;
        font-size: .3rem;
        &.btn-disable{
          .btn-disable;
        }
        &.btn-purple{
          .btn-purple;
        }
      }
    }
  }
 </style>
